# JoistSystemNumBeamsSameType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..JoistSystemNumBeamsSameType Property
ParameterTypeId Class See Also
---
"Num. of Beams With Same Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId JoistSystemNumBeamsSameType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoistSystemNumBeamsSameType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoistSystemNumBeamsSameType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace